# Module 1 - Manipulating data with Pandas (continued)
## Pandas Part 2

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continue to look at a real data set collected by [Austin Animal Center](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) over several years and use our Pandas skills from last class and learn some new ones in order to explore this data further.

#### *Our goals today are to be able to*:  

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use info, describe and dtypes
  - Use `mean`, `min`, `max`, and `value_counts` 
- Use `apply` and `applymap` to transform columns and create new values

- Explain lambda functions and use them to use an apply on a DataFrame
- Explain what a `groupby` object is and split a DataFrame using `groupby`
- Reshape a DataFrame using joins, merges, pivoting, stacking, and melting

## Getting started

Before we look at the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [3]:
!pwd
!ls -al data
# This shows the data file

/Users/cathyxu/code/FlatironDS/hbs-ds-060120/module-1/day-6-pandas-2
total 69464
drwxr-xr-x   5 cathyxu  staff       160 Jun  8 16:11 .
drwxr-xr-x  10 cathyxu  staff       320 Jun  8 16:16 ..
-rw-r--r--   1 cathyxu  staff  18914187 Jun  8 16:11 animal_intakes.csv
-rw-r--r--   1 cathyxu  staff  16634474 Jun  8 16:11 animal_outcomes.csv
-rwxr-xr-x   1 cathyxu  staff     11328 Jun  8 10:31 heart.csv

In [4]:
import pandas as pd
uci = pd.read_csv('data/heart.csv')

In [5]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### The `.columns` and `.shape` Attributes

In [5]:
uci.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [6]:
uci.shape

(303, 14)

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [7]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   sex       303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fbs       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        303 non-null    int64
 12  thal      303 non-null    int64
 13  target    303 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [8]:
# Call the .describe() method on our dataset. What do you observe?
# For a numerical dataset you get a lot of stats! 
uci.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [9]:
# Use the code below. How does the output differ from info() ?
uci.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [10]:
uci.ca.mean()

0.7293729372937293

#### The Axis Variable

In [14]:
uci.mean(axis = 0) # Try [shift] + [tab] here!

age          54.366337
sex           0.683168
cp            0.966997
trestbps    131.623762
chol        246.264026
fbs           0.148515
restecg       0.528053
thalach     149.646865
exang         0.326733
oldpeak       1.039604
slope         1.399340
ca            0.729373
thal          2.313531
target        0.544554
dtype: float64

In [16]:
uci.sum()

age         16473.0
sex           207.0
cp            293.0
trestbps    39882.0
chol        74618.0
fbs            45.0
restecg       160.0
thalach     45343.0
exang          99.0
oldpeak       315.0
slope         424.0
ca            221.0
thal          701.0
target        165.0
dtype: float64

#### .`value_counts()`

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [30]:
uci['age'].value_counts()[:10]

29    1
74    1
76    1
77    1
37    2
34    2
38    3
69    3
71    3
40    3
Name: age, dtype: int64

In [31]:
uci['age'].value_counts().index

Int64Index([58, 57, 54, 59, 52, 51, 62, 44, 60, 56, 64, 41, 63, 67, 55, 45, 42,
            53, 61, 65, 43, 66, 50, 48, 46, 49, 47, 39, 35, 68, 70, 40, 71, 69,
            38, 34, 37, 77, 76, 74, 29],
           dtype='int64')

In [49]:
# making a df out of .value_counts():
age_counts = pd.DataFrame(uci.age.value_counts())
age_counts.head()

    age
58   19
57   17
54   16
59   14
52   13

In [50]:
age_counts.columns = ['count'] # first way to rename column
age_counts.head()

    count
58     19
57     17
54     16
59     14
52     13

In [51]:
age_counts = age_counts.reset_index()

In [52]:
age_counts.head()

   index  count
0     58     19
1     57     17
2     54     16
3     59     14
4     52     13

In [53]:
age_counts.rename(columns = {'index':'age'}) # second way to rename column
age_counts.head()
# ????

   index  count
0     58     19
1     57     17
2     54     16
3     59     14
4     52     13

Exercise: What are the different values for restecg?

In [27]:
# Your code here!
uci.restecg.value_counts()[:10]

1    152
0    147
2      4
Name: restecg, dtype: int64

In [29]:
# this tracks the values in Pandas series uci.restecg.value_counts():
uci.restecg.value_counts().values

array([152, 147,   4])

In [25]:
uci.restecg.unique()

array([0, 1, 2])

### Apply to Animal Shelter Data
Using `.info()` and `.describe()` and `dtypes` what observations can we make about the data?

What are the breed value counts?

How about age counts for dogs?

In [6]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [7]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118010 entries, 0 to 118009
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Animal ID         118010 non-null  object
 1   Name              81039 non-null   object
 2   DateTime          118010 non-null  object
 3   MonthYear         118010 non-null  object
 4   Date of Birth     118010 non-null  object
 5   Outcome Type      118001 non-null  object
 6   Outcome Subtype   53645 non-null   object
 7   Animal Type       118010 non-null  object
 8   Sex upon Outcome  118006 non-null  object
 9   Age upon Outcome  117957 non-null  object
 10  Breed             118010 non-null  object
 11  Color             118010 non-null  object
dtypes: object(12)
memory usage: 10.8+ MB

In [8]:
animal_outcomes.describe()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
count,118010,81039,118010,118010,118010,118001,53645,118010,118006,117957,118010,118010
unique,105490,18949,97251,97251,6853,9,22,5,5,50,2571,585
top,A721033,Max,04/18/2016 12:00:00 AM,04/18/2016 12:00:00 AM,04/21/2014,Adoption,Partner,Dog,Neutered Male,1 year,Domestic Shorthair Mix,Black/White
freq,33,531,39,39,117,51979,29273,67138,41428,21238,30780,12402

In [9]:
animal_outcomes.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A794011,Chunk,05/08/2019 06:20:00 PM,05/08/2019 06:20:00 PM,05/02/2017,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White
1,A776359,Gizmo,07/18/2018 04:02:00 PM,07/18/2018 04:02:00 PM,07/12/2017,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown
2,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
3,A674754,NaN,03/18/2014 11:47:00 AM,03/18/2014 11:47:00 AM,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
4,A689724,*Donatello,10/18/2014 06:52:00 PM,10/18/2014 06:52:00 PM,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black

In [10]:
animal_outcomes.dtypes

Animal ID           object
Name                object
DateTime            object
MonthYear           object
Date of Birth       object
Outcome Type        object
Outcome Subtype     object
Animal Type         object
Sex upon Outcome    object
Age upon Outcome    object
Breed               object
Color               object
dtype: object

What are the breed `value_counts`?
What's the top breed for adopted dogs?

How about outcome counts for dogs?

In [55]:
animal_outcomes.Breed.value_counts()

Domestic Shorthair Mix                                  30780
Pit Bull Mix                                             8305
Labrador Retriever Mix                                   6645
Chihuahua Shorthair Mix                                  6174
Domestic Shorthair                                       5229
                                                        ...
Collie Rough/Labrador Retriever                             1
Yorkshire Terrier/Yorkshire Terrier                         1
American Staffordshire Terrier/Australian Cattle Dog        1
Collie Smooth/Siberian Husky                                1
Pbgv/Pit Bull                                               1
Name: Breed, Length: 2571, dtype: int64

In [11]:
animal_outcomes['Animal Type'].unique()

array(['Cat', 'Dog', 'Other', 'Bird', 'Livestock'], dtype=object)

In [12]:
# filter for Dog in Animal Type:
animal_outcomes.loc[animal_outcomes['Animal Type'] == "Dog"].head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
1,A776359,Gizmo,07/18/2018 04:02:00 PM,07/18/2018 04:02:00 PM,07/12/2017,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown
2,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
14,A765349,Einstein,06/08/2018 01:04:00 PM,06/08/2018 01:04:00 PM,01/18/2009,Adoption,Foster,Dog,Neutered Male,9 years,Chihuahua Shorthair Mix,Tricolor
15,A760697,Star,10/26/2017 03:22:00 PM,10/26/2017 03:22:00 PM,10/23/2007,Transfer,Partner,Dog,Intact Male,10 years,Yorkshire Terrier Mix,Brown/Black
16,A767231,Millie,02/25/2018 05:19:00 PM,02/25/2018 05:19:00 PM,02/25/2017,Return to Owner,NaN,Dog,Spayed Female,1 year,Jack Russell Terrier/Chihuahua Shorthair,White/Tan

In [71]:
(animal_outcomes['Animal Type'] == "Dog") & (animal_outcomes['Outcome Type'] == "Adoption")
# &, | are bit-wise operator: they will compare each element side-by-side and determine if they are equal. 
# word "and" is a boolean operator and assumes the statement in () can be reduced to a single T/F, but that's not the case here.

0         False
1          True
2          True
3         False
4         False
          ...
117995    False
117996    False
117997     True
117998    False
117999     True
Length: 118000, dtype: bool

In [64]:
bin(8)

'0b1000'

In [65]:
bin(7)

'0b111'

In [67]:
0b1000 & 0b0111
# output is 0 because it compares each digit and returns 0

0

In [68]:
0b0111 & 0b0111

7

In [70]:
0b1111 | 0b1111

15

In [59]:
animal_outcomes.loc[animal_outcomes['Animal Type'] == "Dog", 'Breed'].head()

1                      Chihuahua Shorthair Mix
2           Anatol Shepherd/Labrador Retriever
14                     Chihuahua Shorthair Mix
15                       Yorkshire Terrier Mix
16    Jack Russell Terrier/Chihuahua Shorthair
Name: Breed, dtype: object

In [62]:
animal_outcomes.loc[(animal_outcomes['Animal Type'] == "Dog") & (animal_outcomes['Outcome Type'] == "Adoption"), 'Breed'].value_counts()[0:1]

Labrador Retriever Mix    3417
Name: Breed, dtype: int64

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [72]:
def successor(x):
    return x + 1

In [73]:
uci.applymap(successor).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [74]:
uci['age'].map(successor).tail(10)

293    68
294    45
295    64
296    64
297    60
298    58
299    46
300    69
301    58
302    58
Name: age, dtype: int64

In [75]:
# instead of passing in a function, pass in a dict:
uci['sex'].map({0:'male',1:'female'}).head()

0    female
1    female
2      male
3    female
4      male
Name: sex, dtype: object

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [81]:
uci['oldpeak'].map(lambda x: round(x))[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

In [83]:
# above is same as:
def new_round_func(x):
    return round(x)

In [84]:
uci['oldpeak'].map(new_round_func)[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

In [85]:
uci['oldpeak'].map(lambda x: f'my new peak is {x}!')[:4]

0    my new peak is 2.3!
1    my new peak is 3.5!
2    my new peak is 1.4!
3    my new peak is 0.8!
Name: oldpeak, dtype: object

In [86]:
uci['new peak'] = uci['oldpeak'].map(lambda x: f'my new peak is {x}!')[:4]

In [87]:
uci.head()
# row 4 is NaN because the code above is only applied to first 4 rows.

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,new peak
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1,my new peak is 2.3!
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,my new peak is 3.5!
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1,my new peak is 1.4!
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1,my new peak is 0.8!
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1,NaN

Exercise: Use an anonymous function to turn the entries in age to strings

In [80]:
uci['age'].map(lambda x: str(x)).head()

0    63
1    37
2    41
3    56
4    57
Name: age, dtype: object

In [88]:
uci.age.map(lambda qwerty: f'age: {qwerty}')

0      age: 63
1      age: 37
2      age: 41
3      age: 56
4      age: 57
        ...
298    age: 57
299    age: 45
300    age: 68
301    age: 57
302    age: 57
Name: age, Length: 303, dtype: object

In [90]:
# Lambda can be created outside of map function, but it's expressly against the style guide of Python! 
squared = lambda x: x**2

In [91]:
squared(40)

1600

### Apply to Animal Shelter Data

Use an `apply` to change the dates from strings to datetime objects. Similarly, use an apply to change the ages of the animals from strings to floats.

In [ ]:
# Your code here

In [13]:
animal_outcomes['DateTime'] = pd.to_datetime(animal_outcomes["DateTime"])

In [14]:
animal_outcomes['MonthYear'] = pd.to_datetime(animal_outcomes.MonthYear)

In [15]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118010 entries, 0 to 118009
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Animal ID         118010 non-null  object
 1   Name              81039 non-null   object
 2   DateTime          118010 non-null  datetime64[ns]
 3   MonthYear         118010 non-null  datetime64[ns]
 4   Date of Birth     118010 non-null  object
 5   Outcome Type      118001 non-null  object
 6   Outcome Subtype   53645 non-null   object
 7   Animal Type       118010 non-null  object
 8   Sex upon Outcome  118006 non-null  object
 9   Age upon Outcome  117957 non-null  object
 10  Breed             118010 non-null  object
 11  Color             118010 non-null  object
dtypes: datetime64[ns](2), object(10)
memory usage: 10.8+ MB

In [16]:
pd.to_datetime(animal_outcomes["Date of Birth"])[:10]

0   2017-05-02
1   2017-07-12
2   2015-10-08
3   2014-03-12
4   2014-08-01
5   2014-06-03
6   2012-07-26
7   2010-01-20
8   2014-06-09
9   2019-08-08
Name: Date of Birth, dtype: datetime64[ns]

In [17]:
animal_outcomes['Date of Birth'] = pd.to_datetime(animal_outcomes['Date of Birth'])

In [18]:
import datetime

In [19]:
diff = datetime.date.today() - datetime.date(2010,5,15)

In [36]:
print(diff)

3677 days, 0:00:00

In [35]:
print(diff.days)

3677

In [20]:
round(diff.days / 365)

10

In [21]:
type(datetime.date.today())

datetime.date

In [22]:
type(datetime.datetime.now())

datetime.datetime

In [27]:
# Note: in the def function below, we use .now() not .today() because of data type
def calculate_age(val):
    return round((datetime.datetime.now() - val).days /365,2)

In [29]:
calculate_age(datetime.datetime(1776, 7, 4))

244.09

In [32]:
animal_outcomes['age'] = animal_outcomes['Date of Birth'].map(calculate_age)

In [31]:
animal_outcomes

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A794011,Chunk,2019-05-08 18:20:00,2019-05-08 18:20:00,2017-05-02,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White
1,A776359,Gizmo,2018-07-18 16:02:00,2018-07-18 16:02:00,2017-07-12,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown
2,A720371,Moose,2016-02-13 17:59:00,2016-02-13 17:59:00,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
3,A674754,NaN,2014-03-18 11:47:00,2014-03-18 11:47:00,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
4,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18 18:52:00,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
...,...,...,...,...,...,...,...,...,...,...,...,...
118005,A818386,NaN,2020-06-08 13:49:00,2020-06-08 13:49:00,2017-06-08,NaN,NaN,Dog,Intact Male,NaN,Pit Bull/Chinese Sharpei,Red
118006,A818382,Cookie,2020-06-08 13:47:00,2020-06-08 13:47:00,2020-04-08,Transfer,Partner,Dog,Intact Male,1 month,Boxer,Brown/Black
118007,A732172,Clyde,2018-05-07 18:23:00,2018-05-07 18:23:00,2014-03-04,Return to Owner,NaN,Dog,Intact Male,4 years,Catahoula Mix,Black Brindle/White
118008,A732172,Clyde,2016-12-07 15:13:00,2016-12-07 15:13:00,2014-03-04,Return to Owner,NaN,Dog,Intact Male,2 years,Catahoula Mix,Black Brindle/White
118009,A732172,Clyde,2016-08-09 16:49:00,2016-08-09 16:49:00,2014-03-04,Return to Owner,NaN,Dog,Intact Male,2 years,Catahoula Mix,Black Brindle/White

What else can we do? 
1. clean up "Age upon outcome" into a common unit
2. make all titles lower case, and remove spaces
3. remove null values from certain columns
    - outcome type
    - age upon outcome
    - sex upon outcome
1. verify DateTime == MonthYear

In [ ]:
# 2. make all columns lower case, and remove spaces. Use List comprehension! ***
[x.lower().replace(" ", "_") for x in animal_outcomes.columns]

In [138]:
animal_outcomes.columns = [x.lower().replace(" ", "_") for x in animal_outcomes.columns]

In [139]:
animal_outcomes

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A794011,Chunk,2019-05-08 18:20:00,2019-05-08 18:20:00,2017-05-02,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White
1,A776359,Gizmo,2018-07-18 16:02:00,2018-07-18 16:02:00,2017-07-12,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown
2,A720371,Moose,2016-02-13 17:59:00,2016-02-13 17:59:00,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
3,A674754,NaN,2014-03-18 11:47:00,2014-03-18 11:47:00,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
4,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18 18:52:00,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
...,...,...,...,...,...,...,...,...,...,...,...,...
117995,A818200,*Baby Spice,2020-06-07 16:34:00,2020-06-07 16:34:00,2020-04-03,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Shorthair,Black/White
117996,A800898,Chile Pepper,2019-07-28 17:48:00,2019-07-28 17:48:00,2006-07-28,Return to Owner,NaN,Dog,Intact Female,13 years,Chihuahua Shorthair,White/Tan
117997,A817995,*Topeka,2020-06-07 18:01:00,2020-06-07 18:01:00,2019-05-30,Adoption,NaN,Dog,Spayed Female,1 year,Labrador Retriever Mix,Brown/White
117998,A818380,NaN,2020-06-07 19:24:00,2020-06-07 19:24:00,2020-05-23,Euthanasia,Rabies Risk,Other,Unknown,2 weeks,Bat,Brown
117999,A818054,NaN,2020-06-07 19:17:00,2020-06-07 19:17:00,2019-06-01,Adoption,NaN,Dog,Spayed Female,1 year,American Staffordshire Terrier,Chocolate/White

In [141]:
# remove null values from certain columns
# outcome type
# age upon outcome
# sex upon outcome

animal_outcomes = animal_outcomes.dropna(subset = ['outcome_type', 'sex_upon_outcome', 'age_upon_outcome'])

In [143]:
# verify DateTime == MonthYear
# if true, drop MonthYear
(animal_outcomes.datetime == animal_outcomes.monthyear).sum()
# this verifies it's true for all rows

117942

In [144]:
animal_outcomes.shape

(117942, 12)

In [145]:
animal_outcomes = animal_outcomes.drop(columns = 'monthyear')

In [146]:
animal_outcomes.head()

,animal_id,name,datetime,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A794011,Chunk,2019-05-08 18:20:00,2017-05-02,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White
1,A776359,Gizmo,2018-07-18 16:02:00,2017-07-12,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown
2,A720371,Moose,2016-02-13 17:59:00,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
3,A674754,NaN,2014-03-18 11:47:00,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
4,A689724,*Donatello,2014-10-18 18:52:00,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black

In [147]:
# clean up "Age upon outcome" into a common unit
animal_outcomes.age_upon_outcome

0          2 years
1           1 year
2         4 months
3           6 days
4         2 months
            ...
117995    2 months
117996    13 years
117997      1 year
117998     2 weeks
117999      1 year
Name: age_upon_outcome, Length: 117942, dtype: object

In [148]:
# First, "see" what all the units are
# split string on space:
animal_outcomes.age_upon_outcome.str.split(' ')

0          [2, years]
1           [1, year]
2         [4, months]
3           [6, days]
4         [2, months]
             ...
117995    [2, months]
117996    [13, years]
117997      [1, year]
117998     [2, weeks]
117999      [1, year]
Name: age_upon_outcome, Length: 117942, dtype: object

In [149]:
animal_outcomes.age_upon_outcome.value_counts()

1 year       21233
2 years      17705
2 months     14128
3 years       7219
3 months      5491
1 month       5149
4 years       4260
5 years       3944
4 months      3747
5 months      2901
6 months      2828
6 years       2617
8 years       2259
7 years       2237
3 weeks       2053
2 weeks       1956
8 months      1874
10 years      1790
4 weeks       1742
10 months     1704
7 months      1514
9 years       1231
9 months      1226
12 years       879
1 weeks        794
11 months      747
11 years       703
1 week         638
13 years       563
14 years       377
3 days         337
2 days         334
15 years       319
1 day          242
6 days         232
4 days         211
0 years        177
5 days         154
16 years       135
5 weeks        112
17 years        78
18 years        48
19 years        25
20 years        17
22 years         4
-1 years         4
25 years         1
24 years         1
21 years         1
-3 years         1
Name: age_upon_outcome, dtype: int64

In [150]:
# Second, there are four units: year, month, week, day. 
def convert_to_days_old(val):
    number, unit = val.split(' ')
    if 'year' in val:
        return 365 * number
    if 'month' in unit:
        return 30 * number
    if 'week' in unit:
        return 7 * number
    if 'day' in unit:
        return number
    
    return 'unknown'

In [151]:
animal_outcomes.age_upon_outcome.map(convert_to_days_old)

0         2222222222222222222222222222222222222222222222...
1         1111111111111111111111111111111111111111111111...
2                            444444444444444444444444444444
3                                                         6
4                            222222222222222222222222222222
                                ...
117995                       222222222222222222222222222222
117996    1313131313131313131313131313131313131313131313...
117997    1111111111111111111111111111111111111111111111...
117998                                              2222222
117999    1111111111111111111111111111111111111111111111...
Name: age_upon_outcome, Length: 117942, dtype: object

In [ ]:
# ^This happened becasue .split() is a string function, so multiplication returns more strings.

In [152]:
def convert_to_days_old(val):
    number, unit = val.split(' ')
    number = int(number)
    if 'year' in val:
        return 365 * number
    if 'month' in unit:
        return 30 * number
    if 'week' in unit:
        return 7 * number
    if 'day' in unit:
        return number
    
    return 'unknown'

In [153]:
animal_outcomes['days_upon_outcome'] = animal_outcomes.age_upon_outcome.map(convert_to_days_old)

In [154]:
animal_outcomes

,animal_id,name,datetime,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,days_upon_outcome
0,A794011,Chunk,2019-05-08 18:20:00,2017-05-02,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White,730
1,A776359,Gizmo,2018-07-18 16:02:00,2017-07-12,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown,365
2,A720371,Moose,2016-02-13 17:59:00,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,120
3,A674754,NaN,2014-03-18 11:47:00,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby,6
4,A689724,*Donatello,2014-10-18 18:52:00,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,60
...,...,...,...,...,...,...,...,...,...,...,...,...
117995,A818200,*Baby Spice,2020-06-07 16:34:00,2020-04-03,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Shorthair,Black/White,60
117996,A800898,Chile Pepper,2019-07-28 17:48:00,2006-07-28,Return to Owner,NaN,Dog,Intact Female,13 years,Chihuahua Shorthair,White/Tan,4745
117997,A817995,*Topeka,2020-06-07 18:01:00,2019-05-30,Adoption,NaN,Dog,Spayed Female,1 year,Labrador Retriever Mix,Brown/White,365
117998,A818380,NaN,2020-06-07 19:24:00,2020-05-23,Euthanasia,Rabies Risk,Other,Unknown,2 weeks,Bat,Brown,14
117999,A818054,NaN,2020-06-07 19:17:00,2019-06-01,Adoption,NaN,Dog,Spayed Female,1 year,American Staffordshire Terrier,Chocolate/White,365

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [ ]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [ ]:
uci.groupby('sex').groups

In [ ]:
uci.groupby('sex').get_group(0) # .tail()

### Aggregating

In [ ]:
uci.groupby('sex').std()

Exercise: Tell me the average cholesterol level for those with heart disease.

In [ ]:
# Your code here!

### Apply to Animal Shelter Data

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types.
- What about by animal types **and** gender?

#### Task 2:
- Create new columns `year` and `month` by using a lambda function x.year on date
- Use `groupby` and `.size()` to tell me how many animals are adopted by month

In [ ]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [ ]:
uci.pivot(values='sex', columns='target').head()

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [ ]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'])

In [ ]:
toy1.join(toy2.set_index('age'),
          on = 'age',
          lsuffix = '_A',
          rsuffix = '_B').head()

### `.merge()`

In [ ]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col = 0)

In [ ]:
states = pd.read_csv('data/states.csv', index_col = 0)

In [ ]:
ds_chars.merge(states,
               left_on='home_state',
               right_on = 'state',
               how = 'inner')

### `pd.concat()`

Exercise: Look up the documentation on pd.concat (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and use it to concatenate ds_chars and states.
<br/>
Your result should still have only five rows!

In [ ]:
pd.concat([ds_chars, states], sort=False)

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [ ]:
ds_chars.head()

In [ ]:
pd.melt(ds_chars,
        id_vars=['name'],
        value_vars=['HP', 'home_state'])

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

_Hints_ :
- import and clean the intake dataset first
- use `apply`/`applymap`/`lambda` to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new `days-in-shelter` column
- Notice that some values in `days_in_shelter` are `NaN` or values < 0 (remove these rows using the "<" operator and `isna()` or `dropna()`)
- Use `groupby` to get aggregate information about the dataset (your choice)

To save your dataset:
Use the notation `df.to_csv()` or `df.to_excel()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
#code here